Revit 2026 API

# RebarInSystemMaxSpacing Property

---

Identifies the maximum spacing between rebar in rebar set.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double MaxSpacing { get; }
```
```vb
Public ReadOnly Property MaxSpacing As Double
	Get
```
```cpp
public:
property double MaxSpacing {
	double get ();
}
```
```fsharp
member MaxSpacing : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |

#### Reference

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace